In [3]:
# pandas 설치
!pip install pandas

Requirement already satisfied: pandas in c:\users\as4761285 001\appdata\local\programs\python\python312\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\as4761285 001\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.1.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\as4761285 001\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\as4761285 001\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\as4761285 001\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\as4761285 001\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [5]:
import pandas as pd
import numpy as np

In [6]:
obj = ['이유리', '최민준', '김민지']
print(obj)

series_1 = pd.Series(obj)
print(type(series_1))
print(series_1)

['이유리', '최민준', '김민지']
<class 'pandas.core.series.Series'>
0    이유리
1    최민준
2    김민지
dtype: object

In [9]:
obj = ['이유리', '최민준', '김민지']
idx = ['A', 'B', 'C']

series_2 = pd.Series(obj, index = idx)
print(series_2)

A    이유리
B    최민준
C    김민지
dtype: object

In [7]:
obj = {
    'A':'이유리', 
    'B':'최민준', 
    'C':'김민지'
    }
series_3 = pd.Series(obj)
print(series_3)

A    이유리
B    최민준
C    김민지
dtype: object

In [15]:
# values 속성
print(series_1.values)

['이유리' '최민준' '김민지']

In [14]:
# index 속성
print(series_1.index)

RangeIndex(start=0, stop=3, step=1)

In [18]:
# dtype 속성 -> 시리즈 객체의 데이터 타입 확인
print(series_1.dtypes)

object

In [26]:
# size 속성 -> 총 객체의 수
print(series_1.size)

3

In [31]:
print(series_1)
series_1.index = ['A', 'B', 'C']
print(series_1.index)

A    이유리
B    최민준
C    김민지
dtype: object
Index(['A', 'B', 'C'], dtype='object')

In [35]:
obj = [22, 32, 27, 18, 38, 19]
idx = list('abcdef') # -> ['a', 'b', 'c', 'd', 'e', 'f']

sr = pd.Series(obj, index = idx)
print(sr)

a    22
b    32
c    27
d    18
e    38
f    19
dtype: int64

In [40]:
# Series 객체의 인덱싱
print(sr[4])
print(sr[-1])
print(sr['c'])

38
19
27

C:\Users\as4761285 001\AppData\Local\Temp\ipykernel_3524\2584963134.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[4])
C:\Users\as4761285 001\AppData\Local\Temp\ipykernel_3524\2584963134.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[-1])

In [43]:
# Series 객체의 슬라이싱
print(sr[1:5])
print(sr[:5])
print(sr['b':'d'])

b    32
c    27
d    18
e    38
dtype: int64
a    22
b    32
c    27
d    18
e    38
dtype: int64
b    32
c    27
d    18
dtype: int64

In [49]:
idx = [0, 3, 4]
print(sr[idx])
print(sr[[1, 5]])

a    22
d    18
e    38
dtype: int64
b    32
f    19
dtype: int64

C:\Users\as4761285 001\AppData\Local\Temp\ipykernel_3524\3721448886.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[idx])
C:\Users\as4761285 001\AppData\Local\Temp\ipykernel_3524\3721448886.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[[1, 5]])

In [50]:
print(sr)

a    22
b    32
c    27
d    18
e    38
f    19
dtype: int64

In [51]:
print(sr[['b', 'd', 'f']])

b    32
d    18
f    19
dtype: int64

In [54]:
# 통계 메소드

sr_1 = pd.Series(range(100)) # range(100) -> [0, 1, 2, 3, ... , 99]

print(sr_1)

0      0
1      1
2      2
3      3
4      4
      ..
95    95
96    96
97    97
98    98
99    99
Length: 100, dtype: int64

In [56]:
# 집계함수 describd() -> 요약 통계량에 대한 정보
sr_1.describe()

count    100.000000
mean      49.500000
std       29.011492
min        0.000000
25%       24.750000
50%       49.500000
75%       74.250000
max       99.000000
dtype: float64

In [58]:
# 집계함수 count() -> 총 객체 수
sr_1.count()

np.int64(100)

In [59]:
# 집계함수 mean() -> 평균
sr_1.mean()

np.float64(49.5)

In [60]:
# 집계함수 var() -> 분산
sr_1.var()

np.float64(841.6666666666666)

In [61]:
# 집계함수 std() -> 표준편차
sr_1.std()

np.float64(29.011491975882016)

In [67]:
# 집계함수 min() -> 최솟값
print(sr_1.min())

# 집계함수 max() -> 최댓값
print(sr_1.max())

# 집계함수 median() -> 중앙값
print(sr_1.median())

0
99
49.5

In [66]:
# quantile() 백분위수
print(sr_1.quantile())
print(sr_1.quantile(q=0.25))
print(sr_1.quantile(q=0.75))

49.5
24.75
74.25

In [68]:
sr_2 = pd.Series(['a', 'b', 'b', 'b', 'c', 'c', 'd'])
sr_2.describe()

count     7
unique    4
top       b
freq      3
dtype: object

In [76]:
# unique() -> 유일한 값 확인
sr_2.unique()

array(['a', 'b', 'c', 'd'], dtype=object)

In [77]:
# value_counts -> 유일한 값의 빈도수 확인
sr_2.value_counts()

b    3
c    2
a    1
d    1
Name: count, dtype: int64

In [79]:
# mode -> 최빈값
sr_2.mode()

0    b
dtype: object

In [7]:
# 데이터 프레임

obj = {
    '이름': ['이유리', '최민준', '김민지'], 
    '전공': ['경영학과', '컴퓨터공학과', '데이터과학과'], 
    '성별': ['여', '남', '여'], 
    '나이': [20, 22, 21]
}

df_1 = pd.DataFrame(obj)
print(df_1)
print(type(df_1))

    이름      전공 성별  나이
0  이유리    경영학과  여  20
1  최민준  컴퓨터공학과  남  22
2  김민지  데이터과학과  여  21
<class 'pandas.core.frame.DataFrame'>

In [10]:
obj2 = np.array([['이유리', '경영학과', '여', 20],
                ['최민준', '컴퓨터공학과', '남', 22],
                ['김민지', '데이터공학과', '여', 21]
                ])

df_2 = pd.DataFrame(obj2)
print(df_2)

     0       1  2   3
0  이유리    경영학과  여  20
1  최민준  컴퓨터공학과  남  22
2  김민지  데이터공학과  여  21

In [12]:
df_3 = pd.DataFrame(
                    obj2, 
                    columns = ['Name', 'Major', 'Sex', 'Age'],
                    index = ['A', 'B', 'C']
                    )
print(df_3)

  Name   Major Sex Age
A  이유리    경영학과   여  20
B  최민준  컴퓨터공학과   남  22
C  김민지  데이터공학과   여  21

In [13]:
obj = {
    'Name': ['Olivia', 'Lucas', 'Sophia', 'Zoe', 'Ava', 'Elliot'],
    'Sex': ['Female', 'Male', 'Female', 'Female', 'Female', 'male'],
    'Age': [22, 32, 27, 18, 38, 19]
}

df = pd.DataFrame(obj)
print(df)

     Name     Sex  Age
0  Olivia  Female   22
1   Lucas    Male   32
2  Sophia  Female   27
3     Zoe  Female   18
4     Ava  Female   38
5  Elliot    male   19

In [17]:
a = df.values
print(a)
print('')
print(type(a))

[['Olivia' 'Female' 22]
 ['Lucas' 'Male' 32]
 ['Sophia' 'Female' 27]
 ['Zoe' 'Female' 18]
 ['Ava' 'Female' 38]
 ['Elliot' 'male' 19]]

<class 'numpy.ndarray'>

In [18]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [19]:
df.columns

Index(['Name', 'Sex', 'Age'], dtype='object')

In [20]:
df.dtypes

Name    object
Sex     object
Age      int64
dtype: object

In [21]:
df.shape

(6, 3)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Sex     6 non-null      object
 2   Age     6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [23]:
df.head()

     Name     Sex  Age
0  Olivia  Female   22
1   Lucas    Male   32
2  Sophia  Female   27
3     Zoe  Female   18
4     Ava  Female   38

In [24]:
df.head(1)

     Name     Sex  Age
0  Olivia  Female   22

In [25]:
df.head(-3)

     Name     Sex  Age
0  Olivia  Female   22
1   Lucas    Male   32
2  Sophia  Female   27

In [26]:
df.tail()

     Name     Sex  Age
1   Lucas    Male   32
2  Sophia  Female   27
3     Zoe  Female   18
4     Ava  Female   38
5  Elliot    male   19

In [29]:
df.tail(1)

     Name   Sex  Age
5  Elliot  male   19

In [31]:
df.tail(-2)

     Name     Sex  Age
2  Sophia  Female   27
3     Zoe  Female   18
4     Ava  Female   38
5  Elliot    male   19

In [44]:
obj = {
    'Name': ['Olivia', 'Lucas', 'Sophia', 'Zoe', 'Ava', 'Elliot'],
    'Sex': ['Female', 'Male', 'Female', 'Female', 'Female', 'male'],
    'Age': [22, 32, 27, 18, 38, 19]
}

idx = list('abcdef') # -> ['a', 'b', ... 'f']
df = pd.DataFrame(obj, index = idx)
df

     Name     Sex  Age
a  Olivia  Female   22
b   Lucas    Male   32
c  Sophia  Female   27
d     Zoe  Female   18
e     Ava  Female   38
f  Elliot    male   19

In [45]:
df['Name']

a    Olivia
b     Lucas
c    Sophia
d       Zoe
e       Ava
f    Elliot
Name: Name, dtype: object

In [ ]:
df.Name

a    Olivia
b     Lucas
c    Sophia
d       Zoe
e       Ava
f    Elliot
Name: Name, dtype: object

In [46]:
print(df[['Name', 'Age']])

     Name  Age
a  Olivia   22
b   Lucas   32
c  Sophia   27
d     Zoe   18
e     Ava   38
f  Elliot   19

In [47]:
df

     Name     Sex  Age
a  Olivia  Female   22
b   Lucas    Male   32
c  Sophia  Female   27
d     Zoe  Female   18
e     Ava  Female   38
f  Elliot    male   19

In [51]:
df.iloc[0]

Name    Olivia
Sex     Female
Age         22
Name: a, dtype: object

In [48]:
df.iloc[1]

Name    Lucas
Sex      Male
Age        32
Name: b, dtype: object

In [49]:
df.iloc[1:5]

     Name     Sex  Age
b   Lucas    Male   32
c  Sophia  Female   27
d     Zoe  Female   18
e     Ava  Female   38

In [54]:
df.iloc[[1, 3, 5]]

     Name     Sex  Age
b   Lucas    Male   32
d     Zoe  Female   18
f  Elliot    male   19

In [52]:
idx = [1, 3]
df.iloc[idx]

    Name     Sex  Age
b  Lucas    Male   32
d    Zoe  Female   18

In [57]:
df.loc['b']

Name    Lucas
Sex      Male
Age        32
Name: b, dtype: object

In [58]:
df.loc['b':'e']

     Name     Sex  Age
b   Lucas    Male   32
c  Sophia  Female   27
d     Zoe  Female   18
e     Ava  Female   38

In [59]:
df.loc[['a', 'c', 'e']]

     Name     Sex  Age
a  Olivia  Female   22
c  Sophia  Female   27
e     Ava  Female   38

In [67]:
print(df['Age'][0])
print('')
print(df['Age']['a'])
print('')
print(df.loc['a']['Age'])

22

22

22

C:\Users\as4761285 001\AppData\Local\Temp\ipykernel_10636\238753211.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df['Age'][0])

In [69]:
df.iloc[1:4]

     Name     Sex  Age
b   Lucas    Male   32
c  Sophia  Female   27
d     Zoe  Female   18

In [70]:
df.iloc[1:4, 1:3]

      Sex  Age
b    Male   32
c  Female   27
d  Female   18

In [72]:
df.loc['b', 'Name']

'Lucas'

In [77]:
rownm = ['b', 'd', 'e']
colnm = ['Name', 'Sex']

# df.loc[['b', 'd', 'e'], ['Name', 'Sex']]
df.loc[rownm, colnm]

    Name     Sex
b  Lucas    Male
d    Zoe  Female
e    Ava  Female

In [80]:
obj = {
    'Name': ['Olivia', 'Lucas', 'Sophia', 'Zoe', 'Ava', 'Elliot'],
    'Sex': ['Female', 'Male', 'Female', 'Female', 'Female', 'male'],
    'Age': [22, 32, 27, 18, 38, 19],
    'Score': [100, 95, 60, 77, 83, 84],
}

df = pd.DataFrame(obj)
df

     Name     Sex  Age  Score
0  Olivia  Female   22    100
1   Lucas    Male   32     95
2  Sophia  Female   27     60
3     Zoe  Female   18     77
4     Ava  Female   38     83
5  Elliot    male   19     84

In [81]:
df.describe()

             Age       Score
count   6.000000    6.000000
mean   26.000000   83.166667
std     7.874008   14.133884
min    18.000000   60.000000
25%    19.750000   78.500000
50%    24.500000   83.500000
75%    30.750000   92.250000
max    38.000000  100.000000